AYCXJY/STM32F103C8T6-SX1281/src/rx_main.cpp
/* ELRS include */

#include "rxtx_common.h"
#include "LowPassFilter.h"

#include "crc.h"
#include "telemetry_protocol.h"
#include "telemetry.h"
#include "stubborn_sender.h"
#include "stubborn_receiver.h"

// #include "lua.h"
#include "msp.h"
#include "msptypes.h"
#include "PFD.h"
// #include "options.h"
// #include "dynpower.h"
#include "MeanAccumulator.h"
// #include "freqTable.h"

// #include "rx-serial/SerialIO.h"
// #include "rx-serial/SerialNOOP.h"
// #include "rx-serial/SerialCRSF.h"
// #include "rx-serial/SerialSBUS.h"
// #include "rx-serial/SerialSUMD.h"
// #include "rx-serial/SerialAirPort.h"
// #include "rx-serial/SerialHoTT_TLM.h"
// #include "rx-serial/SerialMavlink.h"
// #include "rx-serial/SerialTramp.h"
// #include "rx-serial/SerialSmartAudio.h"
//
// #include "rx-serial/devSerialIO.h"
// #include "devLED.h"
// #include "devLUA.h"
// #include "devWIFI.h"
// #include "devButton.h"
// #include "devServoOutput.h"
// #include "devVTXSPI.h"
// #include "devAnalogVbat.h"
// #include "devSerialUpdate.h"
// #include "devBaro.h"
// #include "devMSPVTX.h"
// #include "devThermal.h"

/* User include */

#include <Adafruit_SSD1306.h>
#include "TimerInterrupt_Generic.h"

/* ELRS variable */

// #define SEND_LINK_STATS_TO_FC_INTERVAL 100
// #define DIVERSITY_ANTENNA_INTERVAL 5
// #define DIVERSITY_ANTENNA_RSSI_TRIGGER 5
#define PACKET_TO_TOCK_SLACK 200 // Desired buffer time between Packet ISR and Tock ISR

PFD PFDloop;
// Crc2Byte ota_crc;
ELRS_EEPROM eeprom;
// RxConfig config;
// Telemetry telemetry;
// Stream *SerialLogger;
// bool hardwareConfigured = true;

StubbornSender TelemetrySender;
// static uint8_t telemetryBurstCount;
// static uint8_t telemetryBurstMax;

StubbornReceiver MspReceiver;
uint8_t MspData[ELRS_MSP_BUFFER];

// uint8_t mavlinkSSBuffer[CRSF_MAX_PACKET_LEN]; // Buffer for current stubbon sender packet (mavlink only)

static bool tlmSent = false;
static uint8_t NextTelemetryType = ELRS_TELEMETRY_TYPE_LINK;
static bool telemBurstValid;
/// PFD Filters ////////////////
LPF LPF_Offset(2);
LPF LPF_OffsetDx(4);
/// LQ/RSSI/SNR Calculation //////////
LQCALC<100> LQCalc;
LQCALC<100> LQCalcDVDA;
uint8_t uplinkLQ;
LPF LPF_UplinkRSSI0(5);  // track rssi per antenna
LPF LPF_UplinkRSSI1(5);
MeanAccumulator<int32_t, int8_t, -16> SnrMean;

bool BindingModeRequest = false;
static uint32_t BindingRateChangeTime;
#define BindingRateChangeCyclePeriod 125

static uint8_t scanIndex;
uint8_t ExpressLRS_nextAirRateIndex;
int8_t SwitchModePending;

int32_t PfdPrevRawOffset;
RXtimerState_e RXtimerState;
uint32_t GotConnectionMillis = 0;
// minimum time before we can consider a connection to be 'good'
const uint32_t ConsiderConnGoodMillis = 1000; 
bool doStartTimer = false;

bool didFHSS = false;
bool alreadyFHSS = false;
bool alreadyTLMresp = false;

uint32_t LastValidPacket = 0;           //Time the last valid packet was recv
uint32_t LastSyncPacket = 0;            //Time the last valid packet was recv

/// Variables for Sync Behaviour ////
uint32_t cycleInterval; // in ms
uint32_t RFmodeLastCycled = 0;
#define RFmodeCycleMultiplierSlow 10
uint8_t RFmodeCycleMultiplier;
bool LockRFmode = false;

/* User variable */

#define OLED_RESET     4 
#define SCREEN_WIDTH   128 
#define SCREEN_HEIGHT  64
Adafruit_SSD1306 display(OLED_RESET);

#define AIRRATE RATE_LORA_333HZ_8CH
#define BUADRATE 14400
bool isAirPort = false;

uint16_t fullScount;
uint16_t fullSfreq;
uint16_t fullRcount;
uint16_t fullRfreq;
uint16_t validSendCount;
uint16_t validSendFreq;
uint16_t validReceiveCount;
uint16_t validReceiveFreq;

uint8_t CRCvalue;

#define TIMER_INTERVAL_MS 100000
STM32Timer ITimer(TIM2);

bool UIDIsModified = false;

uint32_t ticktime;
uint32_t tocktime;
uint32_t RxISRtime;
uint32_t slack;

FIFO<AP_MAX_BUF_LEN> apInputBuffer;
FIFO<AP_MAX_BUF_LEN> apOutputBuffer;

#define PACKETSIZE 255
uint8_t StubbornSenderBuffer[PACKETSIZE];
uint8_t StubbornReceiverBuffer[PACKETSIZE];

/* ELRS Function*/

static uint8_t minLqForChaos() // ELRS移植，注释源码另起修改
{
    // Determine the most number of CRC-passing packets we could receive on
    // a single channel out of 100 packets that fill the LQcalc span.
    // The LQ must be GREATER THAN this value, not >=
    // The amount of time we coexist on the same channel is
    // 100 divided by the total number of packets in a FHSS loop (rounded up)
    // and there would be 4x packets received each time it passes by so
    // FHSShopInterval * ceil(100 / FHSShopInterval * numfhss) or
    // FHSShopInterval * trunc((100 + (FHSShopInterval * numfhss) - 1) / (FHSShopInterval * numfhss))
    // With a interval of 4 this works out to: 2.4=4, FCC915=4, AU915=8, EU868=8, EU/AU433=36
    const uint32_t numfhss = FHSSgetChannelCount();
    const uint8_t interval = ExpressLRS_currAirRate_Modparams->FHSShopInterval;
    return interval * ((interval * numfhss + 99) / (interval * numfhss));
}

void SetRFLinkRate(uint8_t index, bool bindMode) // ELRS移植，注释源码另起修改
{
    expresslrs_mod_settings_s *const ModParams = get_elrs_airRateConfig(index);
    expresslrs_rf_pref_params_s *const RFperf = get_elrs_RFperfParams(index);
    // Binding always uses invertIQ
    bool invertIQ = bindMode || (UID[5] & 0x01);

    Serial.println("set rate " + String(index));

    uint32_t interval = ModParams->interval;
#if defined(DEBUG_FREQ_CORRECTION) && defined(RADIO_SX128X)
    interval = interval * 12 / 10; // increase the packet interval by 20% to allow adding packet header
#endif

    hwTimer::updateInterval(interval);

    FHSSusePrimaryFreqBand = !(ModParams->radio_type == RADIO_TYPE_LR1121_LORA_2G4) && !(ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_2G4);
    FHSSuseDualBand = ModParams->radio_type == RADIO_TYPE_LR1121_LORA_DUAL;

    Radio.Config(ModParams->bw, ModParams->sf, ModParams->cr, FHSSgetInitialFreq(),
                 ModParams->PreambleLen, invertIQ, ModParams->PayloadLength, 0
#if defined(RADIO_SX128X)
                 , uidMacSeedGet(), OtaCrcInitializer, (ModParams->radio_type == RADIO_TYPE_SX128x_FLRC)
#endif
#if defined(RADIO_LR1121)
               , ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_900 || ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_2G4, (uint8_t)UID[5], (uint8_t)UID[4]
#endif
                 );

#if defined(RADIO_LR1121)
    if (FHSSuseDualBand)
    {
        Radio.Config(ModParams->bw2, ModParams->sf2, ModParams->cr2, FHSSgetInitialGeminiFreq(),
                    ModParams->PreambleLen2, invertIQ, ModParams->PayloadLength, 0,
                    ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_900 || ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_2G4,
                    (uint8_t)UID[5], (uint8_t)UID[4], SX12XX_Radio_2);
    }
#endif

    Radio.FuzzySNRThreshold = (RFperf->DynpowerSnrThreshUp == DYNPOWER_SNR_THRESH_NONE) ? 0 : (RFperf->DynpowerSnrThreshDn - RFperf->DynpowerSnrThreshUp);

    // checkGeminiMode();
    // if (geminiMode)
    // {
    //     Radio.SetFrequencyReg(FHSSgetInitialGeminiFreq(), SX12XX_Radio_2);
    // }

