AYCXJY/STM32F103C8T6-SX1281/src/rx_main.cpp
    OtaUpdateSerializers(smWideOr8ch, ModParams->PayloadLength);
    MspReceiver.setMaxPackageIndex(31);
    TelemetrySender.setMaxPackageIndex(OtaIsFullRes ? ELRS8_TELEMETRY_MAX_PACKAGES : ELRS4_TELEMETRY_MAX_PACKAGES);

    // // Wait for (11/10) 110% of time it takes to cycle through all freqs in FHSS table (in ms)
    // cycleInterval = ((uint32_t)11U * FHSSgetChannelCount() * ModParams->FHSShopInterval * interval) / (10U * 1000U);

    ExpressLRS_currAirRate_Modparams = ModParams;
    ExpressLRS_currAirRate_RFperfParams = RFperf;
    ExpressLRS_nextAirRateIndex = index; // presumably we just handled this
    telemBurstValid = false;
}

bool ICACHE_RAM_ATTR HandleFHSS() // ELRS移植，注释源码另起修改
{
    uint8_t modresultFHSS = (OtaNonce + 1) % ExpressLRS_currAirRate_Modparams->FHSShopInterval;

    if ((ExpressLRS_currAirRate_Modparams->FHSShopInterval == 0) || alreadyFHSS == true || InBindingMode || (modresultFHSS != 0) || (connectionState == disconnected))
    {
        return false;
    }

    alreadyFHSS = true;

    // if (geminiMode)
    // {
    //     if ((((OtaNonce + 1)/ExpressLRS_currAirRate_Modparams->FHSShopInterval) % 2 == 0) || FHSSuseDualBand) // When in DualBand do not switch between radios.  The OTA modulation paramters and HighFreq/LowFreq Tx amps are set during Config.
    //     {
    //         Radio.SetFrequencyReg(FHSSgetNextFreq(), SX12XX_Radio_1);
    //         Radio.SetFrequencyReg(FHSSgetGeminiFreq(), SX12XX_Radio_2);
    //     }
    //     else
    //     {
    //         // Write radio1 first. This optimises the SPI traffic order.
    //         uint32_t freqRadio2 = FHSSgetNextFreq();
    //         Radio.SetFrequencyReg(FHSSgetGeminiFreq(), SX12XX_Radio_1);
    //         Radio.SetFrequencyReg(freqRadio2, SX12XX_Radio_2);
    //     }
    // }
    // else
    {
        Radio.SetFrequencyReg(FHSSgetNextFreq());
    }

#if defined(RADIO_SX127X)
    // SX127x radio has to reset receive mode after hopping
    uint8_t modresultTLM = (OtaNonce + 1) % ExpressLRS_currTlmDenom;
    if (modresultTLM != 0 || ExpressLRS_currTlmDenom == 1) // if we are about to send a tlm response don't bother going back to rx
    {
        Radio.RXnb();
    }
#endif
#if defined(Regulatory_Domain_EU_CE_2400)
    SetClearChannelAssessmentTime();
#endif
    return true;
}

// void ICACHE_RAM_ATTR LinkStatsToOta(OTA_LinkStats_s * const ls)
// {
//     The value in linkstatistics is "positivized" (inverted polarity)
//     and must be inverted on the TX side. Positive values are used
//     so save a bit to encode which antenna is in use
//     ls->uplink_RSSI_1 = CRSF::LinkStatistics.uplink_RSSI_1;
//     ls->uplink_RSSI_2 = CRSF::LinkStatistics.uplink_RSSI_2;
//     ls->antenna = antenna;
//     ls->modelMatch = connectionHasModelMatch;
//     ls->lq = CRSF::LinkStatistics.uplink_Link_quality;
//     ls->mspConfirm = MspReceiver.GetCurrentConfirm() ? 1 : 0;
// #if defined(DEBUG_FREQ_CORRECTION)
//     ls->SNR = FreqCorrection * 127 / FreqCorrectionMax;
// #else
//     if (SnrMean.getCount())
//     {
//         ls->SNR = SnrMean.mean();
//     }
//     else
//     {
//         ls->SNR = SnrMean.previousMean();
//     }
// #endif
// }

bool ICACHE_RAM_ATTR HandleSendTelemetryResponse() // 逻辑修改，去除链路质量回传
{
    uint8_t modresult = (OtaNonce + 1) % ExpressLRS_currTlmDenom;

    if ((connectionState == disconnected) || (ExpressLRS_currTlmDenom == 1) || (alreadyTLMresp == true) || (modresult != 0))
    // if ((connectionState == disconnected) || (ExpressLRS_currTlmDenom == 1) || (alreadyTLMresp == true) || (modresult != 0) || !teamraceHasModelMatch)
    {
        return false; // don't bother sending tlm if disconnected or TLM is off
    }

    // ESP requires word aligned buffer
    WORD_ALIGNED_ATTR OTA_Packet_s otaPkt = {0};
    alreadyTLMresp = true;
    otaPkt.std.type = PACKET_TYPE_TLM;

    // bool noAirportDataQueued = firmwareOptions.is_airport && apOutputBuffer.size() == 0;
    // bool noTlmQueued = !TelemetrySender.IsActive() && noAirportDataQueued;
    //
    // if (NextTelemetryType == ELRS_TELEMETRY_TYPE_LINK || noTlmQueued)
    // {
    //     OTA_LinkStats_s * ls;
    //     if (OtaIsFullRes)
    //     {
    //         otaPkt.full.tlm_dl.containsLinkStats = 1;
    //         ls = &otaPkt.full.tlm_dl.ul_link_stats.stats;
    //         // // Include some advanced telemetry in the extra space
    //         // // Note the use of `ul_link_stats.payload` vs just `payload`
    //         otaPkt.full.tlm_dl.packageIndex = TelemetrySender.GetCurrentPayload(
    //             otaPkt.full.tlm_dl.ul_link_stats.payload,
    //             sizeof(otaPkt.full.tlm_dl.ul_link_stats.payload));
    //     }
    //     else
    //     {
    //         otaPkt.std.tlm_dl.type = ELRS_TELEMETRY_TYPE_LINK;
    //         ls = &otaPkt.std.tlm_dl.ul_link_stats.stats;
    //     }
    //     LinkStatsToOta(ls);
    //
    //     NextTelemetryType = ELRS_TELEMETRY_TYPE_DATA;
    //     // Start the count at 1 because the next will be DATA and doing +1 before checking
    //     // against Max below is for some reason 10 bytes more code
    //     telemetryBurstCount = 1;
    // }
    // else
    {
        // if (telemetryBurstCount < telemetryBurstMax)
        // {
        //     telemetryBurstCount++;
        // }
        // else
        // {
        //     NextTelemetryType = ELRS_TELEMETRY_TYPE_LINK;
        // }
        if(isAirPort && apInputBuffer.size())
        // else if (firmwareOptions.is_airport)
        {
            validSendCount++;
            OtaPackAirportData(&otaPkt, &apInputBuffer);
        }
        else if (TelemetrySender.IsActive())
        {
            if (OtaIsFullRes)
            {
                otaPkt.full.tlm_dl.packageIndex = TelemetrySender.GetCurrentPayload(
                    otaPkt.full.tlm_dl.payload,
                    sizeof(otaPkt.full.tlm_dl.payload));

            }
            // else
            // {
            //     otaPkt.std.tlm_dl.type = ELRS_TELEMETRY_TYPE_DATA;
            //     otaPkt.std.tlm_dl.packageIndex = TelemetrySender.GetCurrentPayload(
            //         otaPkt.std.tlm_dl.payload,
            //         sizeof(otaPkt.std.tlm_dl.payload));
            // }
        }
        otaPkt.full.tlm_dl.containsLinkStats = MspReceiver.GetCurrentConfirm() ? 1 : 0;
    }

    OtaGeneratePacketCrc(&otaPkt);

    SX12XX_Radio_Number_t transmittingRadio;
    // if (config.GetForceTlmOff())
    // {
    //     transmittingRadio = SX12XX_Radio_NONE;
    // }
    // else if (isDualRadio())
    // {
    //     transmittingRadio = SX12XX_Radio_All;
    // }
    // else
    {
        transmittingRadio = Radio.GetLastSuccessfulPacketRadio();
    }

#if defined(Regulatory_Domain_EU_CE_2400)
    transmittingRadio &= ChannelIsClear(transmittingRadio);   // weed out the radio(s) if channel in use
#endif

    // if (!geminiMode && transmittingRadio == SX12XX_Radio_All) // If the receiver is in diversity mode, only send TLM on a single radio.
    // {
    //     transmittingRadio = Radio.LastPacketRSSI > Radio.LastPacketRSSI2 ? SX12XX_Radio_1 : SX12XX_Radio_2; // Pick the radio with best rf connection to the tx.
    // }

    Radio.TXnb((uint8_t*)&otaPkt, ExpressLRS_currAirRate_Modparams->PayloadLength, transmittingRadio);
    
