AYCXJY/STM32F103C8T6-SX1281/src/rx_main.cpp
    // if (transmittingRadio == SX12XX_Radio_NONE)
    // {
    //     // No packet will be sent due to LBT / Telem forced off.
    //     // Defer TXdoneCallback() to prepare for TLM when the IRQ is normally triggered.
    //     deferExecutionMicros(ExpressLRS_currAirRate_RFperfParams->TOA, Radio.TXdoneCallback);
    // }

    return true;
}

int32_t ICACHE_RAM_ATTR HandleFreqCorr(bool value) // ELRS移植，注释源码另起修改
{
    int32_t tempFC = FreqCorrection;
    if (Radio.GetProcessingPacketRadio() == SX12XX_Radio_2)
    {
        tempFC = FreqCorrection_2;
    }

    if (value)
    {
        if (tempFC > FreqCorrectionMin)
        {
            tempFC--; // FREQ_STEP units
            if (tempFC == FreqCorrectionMin)
            {
                Serial.println("Max -FreqCorrection reached!");
                // DBGLN("Max -FreqCorrection reached!");
            }
        }
    }
    else
    {
        if (tempFC < FreqCorrectionMax)
        {
            tempFC++; // FREQ_STEP units
            if (tempFC == FreqCorrectionMax)
            {
                Serial.println("Max +FreqCorrection reached!");
                // DBGLN("Max +FreqCorrection reached!");
            }
        }
    }

    if (Radio.GetProcessingPacketRadio() == SX12XX_Radio_1)
    {
        FreqCorrection = tempFC;
    }
    else
    {
        FreqCorrection_2 = tempFC;
    }

    return tempFC;
}

void ICACHE_RAM_ATTR updatePhaseLock() // ELRS移植，注释源码另起修改
{
    if (connectionState != disconnected && PFDloop.hasResult())
    {
        int32_t RawOffset = PFDloop.calcResult();
        int32_t Offset = LPF_Offset.update(RawOffset);
        int32_t OffsetDx = LPF_OffsetDx.update(RawOffset - PfdPrevRawOffset);
        PfdPrevRawOffset = RawOffset;

        if (RXtimerState == tim_locked)
        {
            // limit rate of freq offset adjustment, use slot 1
            // because telemetry can fall on slot 1 and will
            // never get here
            if (OtaNonce % 8 == 1)
            {
                if (Offset > 0)
                {
                    hwTimer::incFreqOffset();
                }
                else if (Offset < 0)
                {
                    hwTimer::decFreqOffset();
                }
            }
        }
        if (connectionState != connected)
        {
            hwTimer::phaseShift(RawOffset >> 1);
        }
        else
        {
            hwTimer::phaseShift(Offset >> 2);
        }

        // Serial.println("OFST " + String(Offset) + " ROFST " + String(RawOffset)
        //  + " OFSTD " + String(OffsetDx) + " HWTOFST " + String(hwTimer::getFreqOffset())/* + String(uplinkLQ)*/);
        // DBGVLN("%d:%d:%d:%d:%d", Offset, RawOffset, OffsetDx, hwTimer::getFreqOffset(), uplinkLQ);
        UNUSED(OffsetDx); // complier warning if no debug
    }
    PFDloop.reset();
}

void ICACHE_RAM_ATTR HWtimerCallbackTick() // ELRS移植，注释源码另起修改
{   
    ticktime = micros();
    // Serial.println("tick " + String(ticktime - tocktime));
   
    updatePhaseLock();
    OtaNonce++;
    
    // if (!alreadyTLMresp && !alreadyFHSS && !LQCalc.currentIsSet()) // packet timeout AND didn't DIDN'T just hop or send TLM
    // {
    //     Radio.RXnb(); // put the radio cleanly back into RX in case of garbage data
    // }


    // if (ExpressLRS_currAirRate_Modparams->numOfSends == 1)
    // {
    //     // Save the LQ value before the inc() reduces it by 1
    //     uplinkLQ = LQCalc.getLQ();
    // } else
    // if (!((OtaNonce - 1) % ExpressLRS_currAirRate_Modparams->numOfSends))
    // {
    //     uplinkLQ = LQCalcDVDA.getLQ();
    //     LQCalcDVDA.inc();
    // }

    // CRSF::LinkStatistics.uplink_Link_quality = uplinkLQ;
    // Only advance the LQI period counter if we didn't send Telemetry this period
    if (!alreadyTLMresp)
        LQCalc.inc();

    alreadyTLMresp = false;
    alreadyFHSS = false;
}

void ICACHE_RAM_ATTR HWtimerCallbackTock() // ELRS移植，注释源码另起修改
{
    tocktime = micros();
    slack = tocktime - RxISRtime;
    // if(slack > 300)
        // Serial.println("SLACK " + String(slack));

    PFDloop.intEvent(micros()); // our internal osc just fired

    // if (ExpressLRS_currAirRate_Modparams->numOfSends > 1 && !(OtaNonce % ExpressLRS_currAirRate_Modparams->numOfSends))
    // {
    //     if (LQCalcDVDA.currentIsSet())
    //     {
    //         crsfRCFrameAvailable();
    //         if (teamraceHasModelMatch)
    //             servoNewChannelsAvailable();
    //     }
    //     else
    //     {
    //         crsfRCFrameMissed();
    //     }
    // }
    // else if (ExpressLRS_currAirRate_Modparams->numOfSends == 1)
    // {
    //     if (!LQCalc.currentIsSet())
    //     {
    //         crsfRCFrameMissed();
    //     }
    // }

    // // For any serial drivers that need to send on a regular cadence (i.e. CRSF to betaflight)
    // sendImmediateRC();

    if (!didFHSS)
    {
        HandleFHSS();
    }
    didFHSS = false;

    Radio.isFirstRxIrq = true;
    // updateDiversity();
    tlmSent = HandleSendTelemetryResponse();

    #if defined(DEBUG_RX_SCOREBOARD)
    static bool lastPacketWasTelemetry = false;
    if (!LQCalc.currentIsSet() && !lastPacketWasTelemetry)
        DBGW(lastPacketCrcError ? '.' : '_');
    lastPacketCrcError = false;
    lastPacketWasTelemetry = tlmSent;
    #endif
}

void LostConnection(bool resumeRx) // ELRS移植，注释源码另起修改
{
    Serial.println("lost conn fc= " + String(FreqCorrection) + " fo= " + String(hwTimer::getFreqOffset()));
    // DBGLN("lost conn fc=%d fo=%d", FreqCorrection, hwTimer::getFreqOffset());

    // // Use this rate as the initial rate next time if we connected on it
    // if (connectionState == connected)
    //     config.SetRateInitialIdx(ExpressLRS_nextAirRateIndex);

    RFmodeCycleMultiplier = 1;
    connectionState = disconnected; //set lost connection
    RXtimerState = tim_disconnected;
    hwTimer::resetFreqOffset();
    PfdPrevRawOffset = 0;
    GotConnectionMillis = 0;
    uplinkLQ = 0;
    LQCalc.reset();
    LQCalcDVDA.reset();
    LPF_Offset.init(0);
    LPF_OffsetDx.init(0);
    alreadyTLMresp = false;
    alreadyFHSS = false;

    if (!InBindingMode)
    {
        if (hwTimer::running)
        {
            while(micros() - PFDloop.getIntEventTime() > 250); // time it just after the tock()
            hwTimer::stop();
        }
        SetRFLinkRate(ExpressLRS_nextAirRateIndex, false); // also sets to initialFreq
        // If not resumRx, Radio will be left in SX127x_OPMODE_STANDBY / SX1280_MODE_STDBY_XOSC
        if (resumeRx)
        {
            Radio.RXnb();
        }
    }
    else
    {
        SetRFLinkRate(enumRatetoIndex(AIRRATE), false);
        Radio.RXnb();
    }
}

void ICACHE_RAM_ATTR TentativeConnection(unsigned long now) // ELRS移植，注释源码另起修改
{
    PFDloop.reset();
    connectionState = tentative;
    connectionHasModelMatch = false;
    RXtimerState = tim_disconnected;
    Serial.println("tentative conn");
    // DBGLN("tentative conn");
    PfdPrevRawOffset = 0;
    LPF_Offset.init(0);
    SnrMean.reset();
    RFmodeLastCycled = now; // give another 3 sec for lock to occur

    // The caller MUST call hwTimer::resume(). It is not done here because
    // the timer ISR will fire immediately and preempt any other code
}

void GotConnection(unsigned long now) // ELRS移植，注释源码另起修改
{
    if (connectionState == connected)
    {
        return; // Already connected
    }

    // LockRFmode = firmwareOptions.lock_on_first_connection;

    connectionState = connected; //we got a packet, therefore no lost connection
    RXtimerState = tim_tentative;
    GotConnectionMillis = now;
    // #if defined(PLATFORM_ESP32) || defined(PLATFORM_ESP8266)
    // webserverPreventAutoStart = true;
    // #endif

