AYCXJY/STM32F103C8T6-SX1281/src/rx_main.cpp
    // if (firmwareOptions.is_airport)
    // {
    //     apInputBuffer.flush();
    //     apOutputBuffer.flush();
    // }

    Serial.println("got conn");
    // DBGLN("got conn");
}

void ICACHE_RAM_ATTR OnELRSBindMSP(uint8_t* newUid4) // ELRS移植，注释源码另起修改
{
    // Binding over MSP only contains 4 bytes due to packet size limitations, clear out any leading bytes
    UID[0] = 0;
    UID[1] = 0;
    for (unsigned i = 0; i < 4; i++)
    {
        UID[i + 2] = newUid4[i];
    }

    Serial.print("New UID ");
    for (int i = 0; i < sizeof(UID); i++)
        Serial.print(String(UID[i]) + " ");
    Serial.println();
    // DBGLN("New UID = %u, %u, %u, %u, %u, %u", UID[0], UID[1], UID[2], UID[3], UID[4], UID[5]);

    // // Set new UID in eeprom
    // // EEPROM commit will happen on the main thread in ExitBindingMode()
    // config.SetUID(UID);
    eeprom.Put(0, UID);
    UIDIsModified = true; // 取代 config.IsModified()
}

static void ICACHE_RAM_ATTR ProcessRfPacket_MSP(OTA_Packet_s const * const otaPktPtr) // ELRS移植，注释源码另起修改
{
    uint8_t packageIndex;
    uint8_t const * payload;
    uint8_t dataLen;
    if (OtaIsFullRes)
    {
        packageIndex = otaPktPtr->full.msp_ul.packageIndex;
        payload = otaPktPtr->full.msp_ul.payload;
        dataLen = sizeof(otaPktPtr->full.msp_ul.payload);
        // if (config.GetSerialProtocol() == PROTOCOL_MAVLINK)
        // {
            TelemetrySender.ConfirmCurrentPayload(otaPktPtr->full.msp_ul.tlmFlag);
        // }
        // else
        {
            packageIndex &= ELRS8_TELEMETRY_MAX_PACKAGES;
        }
    }
    else
    {
        packageIndex = otaPktPtr->std.msp_ul.packageIndex;
        payload = otaPktPtr->std.msp_ul.payload;
        dataLen = sizeof(otaPktPtr->std.msp_ul.payload);
        // // User code--show ota msp data
        // Serial.print("recieved data: ");
        // for(int i = 0; i < dataLen; i++)
        // {
        //     Serial.print((char)*(payload + i));
        // }
        // Serial.println("");

        // if (config.GetSerialProtocol() == PROTOCOL_MAVLINK)
        {
            TelemetrySender.ConfirmCurrentPayload(otaPktPtr->std.msp_ul.tlmFlag);
        }
        // else
        {
            packageIndex &= ELRS4_TELEMETRY_MAX_PACKAGES;
        }
    }

    // Always examine MSP packets for bind information if in bind mode
    // [1] is the package index, first packet of the MSP
    if (InBindingMode && packageIndex == 1 && payload[0] == MSP_ELRS_BIND)
    {
        OnELRSBindMSP((uint8_t *)&payload[1]);
        return;
    }

    // Must be fully connected to process MSP, prevents processing MSP
    // during sync, where packets can be received before connection
    if (connectionState != connected)
        return;

    bool currentMspConfirmValue = MspReceiver.GetCurrentConfirm();
    MspReceiver.ReceiveData(packageIndex, payload, dataLen);
    // if (currentMspConfirmValue != MspReceiver.GetCurrentConfirm())
    // {
    //     NextTelemetryType = ELRS_TELEMETRY_TYPE_LINK;
    // }
}

static bool ICACHE_RAM_ATTR ProcessRfPacket_SYNC(uint32_t const now, OTA_Sync_s const * const otaSync)
{
    // Verify the first two of three bytes of the binding ID, which should always match
    if (otaSync->UID3 != UID[3] || otaSync->UID4 != UID[4])
        return false;

    // // The third byte will be XORed with inverse of the ModelId if ModelMatch is on
    // // Only require the first 18 bits of the UID to match to establish a connection
    // // but the last 6 bits must modelmatch before sending any data to the FC
    // if ((otaSync->UID5 & ~MODELMATCH_MASK) != (UID[5] & ~MODELMATCH_MASK))
    //     return false;

    LastSyncPacket = now;
#if defined(DEBUG_RX_SCOREBOARD)
    DBGW('s');
#endif

    // // Will change the packet air rate in loop() if this changes
    // ExpressLRS_nextAirRateIndex = otaSync->rateIndex;
    // updateSwitchModePendingFromOta(otaSync->switchEncMode);

    // // Update TLM ratio, should never be TLM_RATIO_STD/DISARMED, the TX calculates the correct value for the RX
    // expresslrs_tlm_ratio_e TLMrateIn = (expresslrs_tlm_ratio_e)(otaSync->newTlmRatio + (uint8_t)TLM_RATIO_NO_TLM);
    // uint8_t TlmDenom = TLMratioEnumToValue(TLMrateIn);
    // if (ExpressLRS_currTlmDenom != TlmDenom)
    // {
    //     DBGLN("New TLMrate 1:%u", TlmDenom);
    //     ExpressLRS_currTlmDenom = TlmDenom;
    //     telemBurstValid = false;
    // }

    // // modelId = 0xff indicates modelMatch is disabled, the XOR does nothing in that case
    // uint8_t modelXor = (~config.GetModelId()) & MODELMATCH_MASK;
    // bool modelMatched = otaSync->UID5 == (UID[5] ^ modelXor);
    // DBGVLN("MM %u=%u %d", otaSync->UID5, UID[5], modelMatched);

    if (connectionState == disconnected
        || OtaNonce != otaSync->nonce
        || FHSSgetCurrIndex() != otaSync->fhssIndex
        // || connectionHasModelMatch != modelMatched
        )
    {
        //DBGLN("\r\n%ux%ux%u", OtaNonce, otaPktPtr->sync.nonce, otaPktPtr->sync.fhssIndex);
        FHSSsetCurrIndex(otaSync->fhssIndex);
        OtaNonce = otaSync->nonce;
        TentativeConnection(now);
        // // connectionHasModelMatch must come after TentativeConnection, which resets it
        // connectionHasModelMatch = modelMatched;
        return true;
    }

    return false;
}

bool ICACHE_RAM_ATTR ProcessRFPacket(SX12xxDriverCommon::rx_status const status) // ELRS移植，注释源码另起修改
{
    if (status != SX12xxDriverCommon::SX12XX_RX_OK)
    {
        // Serial.println("HW CRC error");
        // DBGVLN("HW CRC error");
        #if defined(DEBUG_RX_SCOREBOARD)
            lastPacketCrcError = true;
        #endif
        return false;
    }
    uint32_t const beginProcessing = micros();

    OTA_Packet_s * const otaPktPtr = (OTA_Packet_s * const)Radio.RXdataBuffer;
    
    if(OtaIsFullRes)
        CRCvalue = otaPktPtr->full.crc;
    else 
        CRCvalue = otaPktPtr->std.crcLow | otaPktPtr->std.crcHigh;

    if (!OtaValidatePacketCrc(otaPktPtr))
    {
        // Serial.println("CRC error");
        // DBGVLN("CRC error");
        #if defined(DEBUG_RX_SCOREBOARD)
            lastPacketCrcError = true;
        #endif
        return false;
    }

    PFDloop.extEvent(beginProcessing + PACKET_TO_TOCK_SLACK);

