AYCXJY/STM32F103C8T6-SX1281/src/rx_main.cpp
    doStartTimer = false;
    unsigned long now = millis();

    LastValidPacket = now;

    switch (otaPktPtr->std.type)
    {
    case PACKET_TYPE_RCDATA: //Standard RC Data Packet
        // ProcessRfPacket_RC(otaPktPtr);
        break;
    case PACKET_TYPE_MSPDATA:
        ProcessRfPacket_MSP(otaPktPtr);
        break;
    case PACKET_TYPE_SYNC: //sync packet from master
        doStartTimer = ProcessRfPacket_SYNC(now,
            OtaIsFullRes ? &otaPktPtr->full.sync.sync : &otaPktPtr->std.sync)
            && !InBindingMode;
        break;
    case PACKET_TYPE_TLM:
        if (isAirPort)
        // if (firmwareOptions.is_airport)
        {
            validReceiveCount++;
            OtaUnpackAirportData(otaPktPtr, &apOutputBuffer);
        }
        break;
    default:
        break;
    }

    // // Store the LQ/RSSI/Antenna
    // Radio.GetLastPacketStats();
    // getRFlinkInfo();

    if (Radio.FrequencyErrorAvailable())
    {
    #if defined(RADIO_SX127X)
        // Adjusts FreqCorrection for RX freq offset
        int32_t tempFreqCorrection = HandleFreqCorr(Radio.GetFrequencyErrorbool());
        // Teamp900 also needs to adjust its demood PPM
        Radio.SetPPMoffsetReg(tempFreqCorrection);
    #else /* !RADIO_SX127X */
        // Adjusts FreqCorrection for RX freq offset
        HandleFreqCorr(Radio.GetFrequencyErrorbool());
    #endif /* RADIO_SX127X */
    }

    // Received a packet, that's the definition of LQ
    LQCalc.add();
    // Extend sync duration since we've received a packet at this rate
    // but do not extend it indefinitely
    RFmodeCycleMultiplier = RFmodeCycleMultiplierSlow;

#if defined(DEBUG_RX_SCOREBOARD)
    if (otaPktPtr->std.type != PACKET_TYPE_SYNC) DBGW(connectionHasModelMatch ? 'R' : 'r');
#endif

    return true;
}

bool ICACHE_RAM_ATTR RXdoneISR(SX12xxDriverCommon::rx_status const status) // ELRS移植，注释源码另起修改
{
    fullRcount++;
    RxISRtime = micros();
    // Serial.println("RXdoneISR " + String(RxISRtime));

    if (LQCalc.currentIsSet() && connectionState == connected)
    {
        return false; // Already received a packet, do not run ProcessRFPacket() again.
    }

    if (ProcessRFPacket(status))
    {
        didFHSS = HandleFHSS();

        if (doStartTimer)
        {
            doStartTimer = false;
            hwTimer::resume(); // will throw an interrupt immediately
        }

        return true;
    }
    return false;
}

void ICACHE_RAM_ATTR TXdoneISR() // ELRS移植，注释源码另起修改
{
    fullScount++;

    Radio.RXnb();
#if defined(Regulatory_Domain_EU_CE_2400)
    SetClearChannelAssessmentTime();
#endif
#if defined(DEBUG_RX_SCOREBOARD)
    DBGW('T');
#endif
}

static void setupBindingFromConfig() // ELRS移植，注释源码另起修改
{
    // // VolatileBind's only function is to prevent loading the stored UID into RAM
    // // which makes the RX boot into bind mode every time
    // if (config.GetIsBound())
    // {
    //     memcpy(UID, config.GetUID(), UID_LEN);
    // }
    eeprom.Begin();
    eeprom.Get(0, UID);

    Serial.print("UID ");
    for (int i = 0; i < sizeof(UID); i++)
        Serial.print(String(UID[i]) + " ");
    Serial.println();
    // DBGLN("UID=(%d, %d, %d, %d, %d, %d) ModelId=%u",
    //     UID[0], UID[1], UID[2], UID[3], UID[4], UID[5], config.GetModelId());

    OtaUpdateCrcInitFromUid();
}

static void setupRadio() // ELRS移植，注释源码另起修改
{
    Radio.currFreq = FHSSgetInitialFreq();
#if defined(RADIO_SX127X)
    //Radio.currSyncWord = UID[3];
#endif
    bool init_success = Radio.Begin(FHSSgetMinimumFreq(), FHSSgetMaximumFreq());
    // POWERMGNT::init();
    if (!init_success)
    {
        Serial.println("Failed to detect RF chipset!!!");
        connectionState = radioFailed;
        return;
    }

    // DynamicPower_UpdateRx(true);

#if defined(Regulatory_Domain_EU_CE_2400)
    LBTEnabled = (config.GetPower() > PWR_10mW);
#endif

    Radio.RXdoneCallback = &RXdoneISR;
    Radio.TXdoneCallback = &TXdoneISR;

    SetRFLinkRate(enumRatetoIndex(AIRRATE), false);
    // scanIndex = config.GetRateInitialIdx();
    // SetRFLinkRate(scanIndex, false);
    // // Start slow on the selected rate to give it the best chance
    // // to connect before beginning rate cycling
    // RFmodeCycleMultiplier = RFmodeCycleMultiplierSlow / 2;
}

/* If not connected will rotate through the RF modes looking for sync
 * and blink LED
 */
// static void cycleRfMode(unsigned long now)
// {
//     if (connectionState == connected || connectionState == wifiUpdate || InBindingMode)
//         return;
//
//     // Actually cycle the RF mode if not LOCK_ON_FIRST_CONNECTION
//     if (LockRFmode == false && (now - RFmodeLastCycled) > (cycleInterval * RFmodeCycleMultiplier))
//     {
//         RFmodeLastCycled = now;
//         LastSyncPacket = now;           // reset this variable
//         // SendLinkStatstoFCForcedSends = 2;
//         SetRFLinkRate(scanIndex % RATE_MAX, false); // switch between rates
//         LQCalc.reset100();
//         LQCalcDVDA.reset100();
//         // Display the current air rate to the user as an indicator something is happening
//         scanIndex++;
//         Radio.RXnb();
//
//         Serial.println(String(ExpressLRS_currAirRate_Modparams->interval));
//         // DBGLN("%u", ExpressLRS_currAirRate_Modparams->interval);
//
//         // Switch to FAST_SYNC if not already in it (won't be if was just connected)
//         RFmodeCycleMultiplier = 1;
//     } // if time to switch RF mode
// }

static void EnterBindingMode() // ELRS移植，注释源码另起修改
{
    if (InBindingMode)
    {
        // DBGLN("Already in binding mode");
        Serial.println("Already in binding mode");
        return;
    }

    // Binding uses a CRCInit=0, 50Hz, and InvertIQ
    OtaCrcInitializer = 0;
    InBindingMode = true;
    // // Any method of entering bind resets a loan
    // // Model can be reloaned immediately by binding now
    // config.ReturnLoan();
    // config.Commit();

    // Start attempting to bind
    // Lock the RF rate and freq while binding
    SetRFLinkRate(enumRatetoIndex(RATE_BINDING), true);

    // If the Radio Params (including InvertIQ) parameter changed, need to restart RX to take effect
    Radio.RXnb();

    Serial.println("Entered binding mode at freq = " + String(Radio.currFreq));
    // DBGLN("Entered binding mode at freq = %d", Radio.currFreq);
    // devicesTriggerEvent();
}

static void ExitBindingMode() // ELRS移植，注释源码另起修改
{
    if (!InBindingMode)
    {
        // DBGLN("Not in binding mode");
        Serial.println("Not in binding mode");
        return;
    }

    MspReceiver.ResetState();

    // Prevent any new packets from coming in
    Radio.SetTxIdleMode();
    // Write the values to eeprom
    eeprom.Commit();
    // config.Commit();

    OtaUpdateCrcInitFromUid();
    FHSSrandomiseFHSSsequence(uidMacSeedGet());

    #if defined(PLATFORM_ESP32) || defined(PLATFORM_ESP8266)
    webserverPreventAutoStart = true;
    #endif

    // // Force RF cycling to start at the beginning immediately
    // scanIndex = RATE_MAX;
    // RFmodeLastCycled = 0;
    // LockRFmode = false;
    LostConnection(true);

    // Do this last as LostConnection() will wait for a tock that never comes
    // if we're in binding mode
    InBindingMode = false;
    Serial.println("Exiting binding mode");
    // DBGLN("Exiting binding mode");
    // devicesTriggerEvent();
}

static void updateBindingMode(unsigned long now) // ELRS移植，注释源码另起修改
{
    // Exit binding mode if the config has been modified, indicating UID has been set
    if (InBindingMode && UIDIsModified)
    // if (InBindingMode && config.IsModified())
    {
        Serial.println("UID has been modified!");
        ExitBindingMode();
    }

#if defined(RADIO_LR1121)
    // Change frequency domains every 500ms.  This will allow single LR1121 receivers to receive bind packets from SX12XX Tx modules.
    else if (InBindingMode && (now - BindingRateChangeTime) > BindingRateChangeCyclePeriod)
    {
        BindingRateChangeTime = now;
        if (ExpressLRS_currAirRate_Modparams->index == RATE_DUALBAND_BINDING)
        {
            SetRFLinkRate(enumRatetoIndex(RATE_BINDING), true);
        }
        else
        {
            SetRFLinkRate(RATE_DUALBAND_BINDING, true);
        }

        Radio.RXnb();
    }
#endif

//     // If the power on counter is >=3, enter binding, the counter will be reset after 2s
//     else if (!InBindingMode && config.GetPowerOnCounter() >= 3)
//     {
// #if defined(PLATFORM_ESP32) || defined(PLATFORM_ESP8266)
//         // Never enter wifi if forced to binding mode
//         webserverPreventAutoStart = true;
// #endif
//         DBGLN("Power on counter >=3, enter binding mode");
//         EnterBindingMode();
//     }

    // If the eeprom is indicating that we're not bound, enter binding
    else if (!UID_IS_BOUND(UID) && !InBindingMode)
    {
        Serial.println("RX has not been bound, enter binding mode");
        // DBGLN("RX has not been bound, enter binding mode");
        EnterBindingMode();
    }

    else if (BindingModeRequest)
    {
        // DBGLN("Connected request to enter binding mode");
        Serial.println("Connected request to enter binding mode");
        BindingModeRequest = false;
        if (connectionState == connected)
        {
            connectionState = disconnected;
            // LostConnection(false);
            // Skip entering bind mode if on loan. This comes from an OTA request
            // and the model is assumed to be inaccessible, do not want the receiver
            // sitting in a field ready to be bound to anyone within 10km
            // if (config.IsOnLoan())
            // {
            //     DBGLN("Model was on loan, becoming inert");
            //     config.ReturnLoan();
            //     config.Commit(); // prevents CheckConfigChangePending() re-enabling radio
            //     Radio.End();
            //     // Enter a completely invalid state for a receiver, to prevent wifi or radio enabling
            //     connectionState = noCrossfire;
            //     return;
            // }
            // // if the InitRate config item was changed by LostConnection
            // // save the config before entering bind, as the modified config
            // // will immediately boot it out of bind mode
            // config.Commit();
        }
        EnterBindingMode();
    }
}

void EnterBindingModeSafely() // ELRS移植，注释源码另起修改
{
    // Will not enter Binding mode if in the process of a passthrough update
    // or currently binding
    if (connectionState == serialUpdate || InBindingMode)
        return;

#if defined(PLATFORM_ESP32) || defined(PLATFORM_ESP8266)
    // Never enter wifi mode after requesting to enter binding mode
    webserverPreventAutoStart = true;

    // If the radio and everything is shut down, better to reboot and boot to binding mode
    if (connectionState == wifiUpdate || connectionState == bleJoystick)
    {
        // Force 3-plug binding mode
        config.SetPowerOnCounter(3);
        config.Commit();
        ESP.restart();
        // Unreachable
    }
#endif

    // If connected, handle that in updateBindingMode()
    if (connectionState == connected)
    {
        BindingModeRequest = true;
        return;
    }

    EnterBindingMode();
}

