AYCXJY/STM32F103C8T6-SX1281/src/rx_main.cpp
/* User Function*/

void displayDebugInfo()
{
    display.clearDisplay();  
    if(InBindingMode)
    {            
        display.setCursor(0, 0);            
        display.println("receiving UID...");
    }
    else
    {
        // UID          
        display.setCursor(0, 0);           
        display.println("ID");         
        display.setCursor(18, 0);            
        display.println(UID[2]);
        display.setCursor(42, 0);            
        display.println(UID[3]);
        display.setCursor(66, 0);            
        display.println(UID[4]);
        display.setCursor(90, 0);            
        display.println(UID[5]);  
        // send freq
        display.setCursor(0, 16);
        display.println("Send");
        display.setCursor(30, 16);
        display.println(validSendFreq);
        // full Send freq
        display.setCursor(54, 16);
        display.println("FullS");
        display.setCursor(92, 16);
        display.println(fullSfreq); 
        // receive freq
        display.setCursor(0, 24);
        display.println("Recv");
        display.setCursor(30, 24);
        display.println(validReceiveFreq);  
        // // full Recv freq
        // display.setCursor(54, 24);
        // display.println("FullR");
        // display.setCursor(92, 24);
        // display.println(fullRfreq);  
    }
    // // CRC
    // display.setCursor(0, 16);
    // display.println("CRC");
    // display.setCursor(24, 16);
    // display.println(CRCvalue);
    // Freq
    display.setCursor(0, 8);           
    display.println("FQ");    
    display.setCursor(18, 8);           
    display.println(Radio.currFreq);  
    // Channel
    display.setCursor(76, 8);           
    display.println("CH");  
    display.setCursor(94, 8);           
    display.println(FHSSgetCurrIndex());  
    // RSSI
    display.setCursor(54, 24);     
    display.println("RSSI");     
    display.setCursor(84, 24);           
    display.println(Radio.GetRssiInst(SX12XX_Radio_All)); 
    display.display();
}

void handleButtonPress() 
{
    delay(25);
    if (digitalRead(PB1) == LOW)
    {
        while (digitalRead(PB1) == LOW)
            ;
        delay(25);
        EnterBindingModeSafely();
    }
}

void TimerHandler() 
{  
    static uint16_t timercount = 0;
    if(timercount % (1000000 / TIMER_INTERVAL_MS) == 0)
    {
        validSendFreq = validSendCount;
        validSendCount = 0;
        validReceiveFreq = validReceiveCount;
        validReceiveCount = 0;
        fullSfreq = fullScount;
        fullScount = 0;
        fullRfreq = fullRcount;
        fullRcount = 0;
    }
    if(connectionState != connected)
    {
        digitalToggle(PC13);
    }
    else
    {
        digitalWrite(PC13, LOW);
    }
    timercount++;
}

void setupBasicHardWare()
{
    // UART
    Serial.begin(BUADRATE);
    // LED
    pinMode(PC13, OUTPUT);
    digitalWrite(PC13, HIGH);
    // Button
    pinMode(PB1, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PB1), handleButtonPress, FALLING);
    // OLED
    Wire.setSCL(PB8);
    Wire.setSDA(PB9);
    Wire.begin();
    display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.clearDisplay();
    display.display();
    // sx1280 GPIO
    pinMode(GPIO_PIN_TX_EN, OUTPUT);
    pinMode(GPIO_PIN_RX_EN, OUTPUT);
    // TIM2
    ITimer.attachInterruptInterval(TIMER_INTERVAL_MS, TimerHandler);
}

static void HandleUARTin()
{
    if(Serial.available())
    {
        auto size = std::min(apInputBuffer.free(), (uint16_t)Serial.available());
        if (size > 0)
        {
            uint8_t buf[size];
            Serial.readBytes(buf, size);
            apInputBuffer.lock();
            apInputBuffer.pushBytes(buf, size);
            apInputBuffer.unlock();
        }
    }
}

static void HandleUARTout()
{
    if(Serial.availableForWrite())
    {
        auto size = apOutputBuffer.size();
        if (size)
        {
            uint8_t buf[size];
            apOutputBuffer.lock();
            apOutputBuffer.popBytes(buf, size);
            apOutputBuffer.unlock();
            Serial.write(buf, size);
        }
    }
}

/* setup and loop */

void setup()
{
    setupBasicHardWare();

    setupBindingFromConfig();

    FHSSrandomiseFHSSsequence(uidMacSeedGet());

    setupRadio();

    if (connectionState != radioFailed)
    {
        MspReceiver.SetDataToReceive(StubbornReceiverBuffer, PACKETSIZE);
        // MspReceiver.SetDataToReceive(MspData, ELRS_MSP_BUFFER);
        Radio.RXnb();
        hwTimer::init(HWtimerCallbackTick, HWtimerCallbackTock);
    }
    hwTimer::resume();

    // setup() eats up some of this time, which can cause the first mode connection to fail.
    // Resetting the time here give the first mode a better chance of connection.
    RFmodeLastCycled = millis();

    ExpressLRS_currTlmDenom = 2;

    Radio.SetOutputPower(SX1280_POWER_MAX);
}

void loop() // ELRS移植，注释源码另起修改
{    
    // displayDebugInfo();

    HandleUARTin();

    HandleUARTout();

    unsigned long now = millis();

    if (MspReceiver.HasFinishedData())
    {
        apOutputBuffer.lock();
        apOutputBuffer.pushBytes(StubbornReceiverBuffer, PACKETSIZE);
        apOutputBuffer.unlock();
        MspReceiver.Unlock();
    }
    if (!TelemetrySender.IsActive())
    {
        auto size = apInputBuffer.size();
        if (size >= PACKETSIZE)
        {
            apInputBuffer.lock();
            apInputBuffer.popBytes(StubbornSenderBuffer, PACKETSIZE);
            apInputBuffer.unlock();
            TelemetrySender.SetDataToTransmit(StubbornSenderBuffer, PACKETSIZE);
        }
    }
    // devicesUpdate(now);

    // // read and process any data from serial ports, send any queued non-RC data
    // handleSerialIO();

    // CheckConfigChangePending();
    // executeDeferredFunction(micros());

    // // Clear the power-on-count
    // if ((connectionState == connected || connectionState == tentative) && config.GetPowerOnCounter() != 0)
    // {
    //     config.SetPowerOnCounter(0);
    // }

    // if (connectionState > MODE_STATES)
    // {
    //     return;
    // }
    // else if(connectionState != disconnected && slack / ExpressLRS_currAirRate_Modparams->interval > 5)
    // {
    //     connectionState = disconnected;
    //     Radio.SetFrequencyReg(FHSSgetInitialFreq());
    // }

