AYCXJY/STM32F103C8T6-SX1281/src/rx_main.cpp
    // if ((connectionState != disconnected) && (ExpressLRS_currAirRate_Modparams->index != ExpressLRS_nextAirRateIndex)){ // forced change
    //     Serial.println("Req air rate change " + String(ExpressLRS_currAirRate_Modparams->index) + " -> " + String(ExpressLRS_nextAirRateIndex));
    //     // DBGLN("Req air rate change %u->%u", ExpressLRS_currAirRate_Modparams->index, ExpressLRS_nextAirRateIndex);
    //     LostConnection(true);
    //     LastSyncPacket = now;           // reset this variable to stop rf mode switching and add extra time
    //     RFmodeLastCycled = now;         // reset this variable to stop rf mode switching and add extra time
    //     // SendLinkStatstoFCintervalLastSent = 0;
    //     // SendLinkStatstoFCForcedSends = 2;
    // }

    if (connectionState == tentative && (now - LastSyncPacket > ExpressLRS_currAirRate_RFperfParams->RxLockTimeoutMs))
    {
        Serial.println("Bad sync, aborting");
        // DBGLN("Bad sync, aborting");
        LostConnection(true);
        RFmodeLastCycled = now;
        LastSyncPacket = now;
    }

    // cycleRfMode(now);

    uint32_t localLastValidPacket = LastValidPacket; // Required to prevent race condition due to LastValidPacket getting updated from ISR
    if ((connectionState == connected) && ((int32_t)ExpressLRS_currAirRate_RFperfParams->DisconnectTimeoutMs < (int32_t)(now - localLastValidPacket))) // check if we lost conn.
    {
        LostConnection(true);
    }

    if ((connectionState == tentative) && (abs(LPF_OffsetDx.value()) <= 10) && (LPF_Offset.value() < 100) && (LQCalc.getLQRaw() > minLqForChaos())) //detects when we are connected
    {
        GotConnection(now);
    }

    // // checkSendLinkStatsToFc(now);

    if ((RXtimerState == tim_tentative) && ((now - GotConnectionMillis) > ConsiderConnGoodMillis) && (abs(LPF_OffsetDx.value()) <= 5))
    {
        RXtimerState = tim_locked;
        // DBGLN("Timer locked");
        Serial.println("Timer locked");
    }

    // uint8_t *nextPayload = 0;
    // uint8_t nextPlayloadSize = 0;
    // if (!TelemetrySender.IsActive() && telemetry.GetNextPayload(&nextPlayloadSize, &nextPayload))
    // {
    //     TelemetrySender.SetDataToTransmit(nextPayload, nextPlayloadSize);
    // }

    // uint16_t count = mavlinkInputBuffer.size();
    // if (count > 0 && !TelemetrySender.IsActive())
    // {
    //     count = std::min(count, (uint16_t)CRSF_PAYLOAD_SIZE_MAX); // Constrain to CRSF max payload size to match SS
    //     // First 2 bytes conform to crsf_header_s format
    //     mavlinkSSBuffer[0] = CRSF_ADDRESS_USB; // device_addr - used on TX to differentiate between std tlm and mavlink
    //     mavlinkSSBuffer[1] = count;
    //     // Following n bytes are just raw mavlink
    //     mavlinkInputBuffer.popBytes(mavlinkSSBuffer + CRSF_FRAME_NOT_COUNTED_BYTES, count);
    //     nextPayload = mavlinkSSBuffer;
    //     nextPlayloadSize = count + CRSF_FRAME_NOT_COUNTED_BYTES;
    //     TelemetrySender.SetDataToTransmit(nextPayload, nextPlayloadSize);
    // }

    // updateTelemetryBurst();
    updateBindingMode(now);
    // updateSwitchMode();
    // checkGeminiMode();
    // DynamicPower_UpdateRx(false);
    // debugRcvrLinkstats();
    // debugRcvrSignalStats(now);
    
    // displayDebugInfo();
}
